CSI API ETABS v1
cAnalysisResultsSetup.SetOptionModalHist Method
 Sets the output option for modal history results.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOptionModalHist(
	int Value
)
Function SetOptionModalHist (
	Value As Integer
) As Integer
Dim instance As cAnalysisResultsSetup
Dim Value As Integer
Dim returnValue As Integer
returnValue = instance.SetOptionModalHist(Value)
int SetOptionModalHist(
	int Value
)
abstract SetOptionModalHist :
        Value : int -> int
Parameters
Value
Type: System.Int32
 This item is 1, 2 or 3
Envelopes
Step-by-Step
Last Step
Return Value
Type: Int32
 Returns 0 if the output option is successfully set, otherwise it returns nonzero.
Remarks
See Also
Reference
cAnalysisResultsSetup Interface
ETABSv1 Namespace